#pragma once

/*

    Измерение пропускной способности (чего-либо)


    У каждого события (например, приход сетевого пакета) есть метка времени (которую мы присваиваем сами),
    и полезная нагрузка (например, размер пакета).

    Мы задаём интервал, на котором хотим 

*/


#include <vector>




//----------------------------------------------------------------------------
namespace invest_openapi
{




//----------------------------------------------------------------------------
template< typename TimeStampType, typename TimeStampMonotonicGetterType >
class RequestBalancer
{
    std::queue<TimeStampType>



}; // class RequestBalancer







//----------------------------------------------------------------------------




//----------------------------------------------------------------------------

} // namespace invest_openapi
